In [271]:
import pandas as pd
from pathlib import Path

In [272]:
pwd

'C:\\Users\\fazle\\Desktop\\Fintech\\python-homework\\Pybank'

In [273]:
import pandas as pd

In [274]:
pd.read_csv('data.csv')

      Date  Profit/Losses
0   Jan-10         867884
1   Feb-10         984655
2   Mar-10         322013
3   Apr-10         -69417
4   May-10         310503
..     ...            ...
81  Oct-16         102685
82  Nov-16         795914
83  Dec-16          60988
84  Jan-17         138230
85  Feb-17         671099

[86 rows x 2 columns]

In [275]:
df = pd.read_csv('data.csv')

In [276]:
df

      Date  Profit/Losses
0   Jan-10         867884
1   Feb-10         984655
2   Mar-10         322013
3   Apr-10         -69417
4   May-10         310503
..     ...            ...
81  Oct-16         102685
82  Nov-16         795914
83  Dec-16          60988
84  Jan-17         138230
85  Feb-17         671099

[86 rows x 2 columns]

In [277]:
df = pd.DataFrame(df)

In [278]:
print(df)

      Date  Profit/Losses
0   Jan-10         867884
1   Feb-10         984655
2   Mar-10         322013
3   Apr-10         -69417
4   May-10         310503
..     ...            ...
81  Oct-16         102685
82  Nov-16         795914
83  Dec-16          60988
84  Jan-17         138230
85  Feb-17         671099

[86 rows x 2 columns]

In [279]:
total_rows=len(df.axes[0])

In [280]:
print("Total Months: "+str(total_rows))

Total Months: 86

In [333]:
total_rows

86

In [334]:
Total = df.sum(axis=0, skipna=True)

In [335]:
print ("Total = $38382578")

Total = $38382578

In [336]:
Total

38382578

In [337]:
df = pd.DataFrame(df)

In [338]:
print(df)

    Revenue
0    867884
1    984655
2    322013
3    -69417
4    310503
..      ...
81   102685
82   795914
83    60988
84   138230
85   671099

[86 rows x 1 columns]

In [339]:
df

    Revenue
0    867884
1    984655
2    322013
3    -69417
4    310503
..      ...
81   102685
82   795914
83    60988
84   138230
85   671099

[86 rows x 1 columns]

In [340]:
list(df.columns)

['Revenue']

In [341]:
df

    Revenue
0    867884
1    984655
2    322013
3    -69417
4    310503
..      ...
81   102685
82   795914
83    60988
84   138230
85   671099

[86 rows x 1 columns]

In [342]:
df = df.rename(columns={'Date' : 'Date', 'Profit/Losses': 'Revenue'})

In [343]:
df

    Revenue
0    867884
1    984655
2    322013
3    -69417
4    310503
..      ...
81   102685
82   795914
83    60988
84   138230
85   671099

[86 rows x 1 columns]

In [344]:
print(df['Revenue'])

0     867884
1     984655
2     322013
3     -69417
4     310503
       ...
81    102685
82    795914
83     60988
84    138230
85    671099
Name: Revenue, Length: 86, dtype: int64

In [345]:
df = (df['Revenue'])

In [346]:
df

0     867884
1     984655
2     322013
3     -69417
4     310503
       ...
81    102685
82    795914
83     60988
84    138230
85    671099
Name: Revenue, Length: 86, dtype: int64

In [347]:
total_change = (df.diff())

In [348]:
print(total_change)

0          NaN
1     116771.0
2    -662642.0
3    -391430.0
4     379920.0
        ...
81   -665765.0
82    693229.0
83   -734926.0
84     77242.0
85    532869.0
Name: Revenue, Length: 86, dtype: float64

In [349]:
mean = total_change.mean(axis=0)

In [350]:
mean

-2315.1176470588234

In [351]:
print("Average Change = $-2315.12")

Average Change = $-2315.12

In [352]:
max = total_change.max()

In [353]:
min = total_change.min()

In [354]:
max

1926159.0

In [355]:
min

-2196167.0

In [392]:
print("Greatest Increase in Profits = $1926159")

Greatest Increase in Profits = $1926159

In [393]:
print("Greatest Decrease in Profits = $-2196167")

Greatest Decrease in Profits = $-2196167

In [394]:
print(total_rows, Total, mean,max,min)

86 38382578 -2315.1176470588234 1926159.0 -2196167.0

In [395]:
header = ["Total Months","Total","Average Change", "Greatest Increase in Profits", "Greatest Decrease in Profits"]

In [396]:
metrics = [total_rows,Total,mean,max,min]

In [384]:
dp = pd.DataFrame(header)

In [385]:
print(dp)

                              0
0                  Total Months
1                         Total
2                Average Change
3  Greatest Increase in Profits
4  Greatest Decrease in Profits

In [398]:
ds = pd.DataFrame(metrics)

In [399]:
print(ds)

              0
0  8.600000e+01
1  3.838258e+07
2 -2.315118e+03
3  1.926159e+06
4 -2.196167e+06

In [416]:
dd = pd.concat([dp ,ds], axis =1)

In [419]:
dd

                              0             0
0                  Total Months  8.600000e+01
1                         Total  3.838258e+07
2                Average Change -2.315118e+03
3  Greatest Increase in Profits  1.926159e+06
4  Greatest Decrease in Profits -2.196167e+06